<template>
	<view class="content" v-if="type==1">
		<view class="title">一、什么是 EVC Wallet</view>
		<view>EVC Wallet是一款区块链数字钱包，暂支持ERC20，它帮助你非常简单、安全地管理在区块链上的账户和资产。</view>
		<view class="title">二、基本概念</view>
		<view class="subtitle">钱包地址</view>
		<view>钱包地址是用于接收和存储区块链资产的一个字符串，以下为例：</view>
		<view>以太坊地址：0x7b334ef4f1a17cb5685e495ec946ac48c47c9128</view>
		<view>你可以转入链上资产到对应公链地址或转出到同公链的其他地址。</view>
		<view class="subtitle">助记词</view>
		<view>助记词是钱包地址最常见的备份形式。在钱包中导入助记词即可恢复对应的钱包地址并控制其中资产。因此助记词备份非常重要，务必妥善保管。</view>
		<view class="subtitle">数字身份</view>
		<view>EVC Wallet通过一组助记词，为用户创建数字身份。数字身份作用：</view>
		<view>同时管理多个钱包；</view>
		<view>数据加密并去中心化存储；</view>
		<view>告别重复注册帐号，一个身份即可体验各式 DApp。</view>
		<view>用熟悉的方式来做类比：</view>
		<view>银行 : 以太坊、比特币、EOS</view>
		<view>银行账户汇总: 数字身份</view>
 		<view>银行卡号 : 钱包地址</view>
		<view>银行卡密码 : 钱包密码</view>
		<view>身份证 : 钱包助记词</view>
		<view>但两者本质区别是巨大的，银行账户是中心化机构执行的结果；钱包基于数学、密码学原理生成，不依赖第三方，完全由你自主掌控。</view>
		<view class="title">三、如何创建数字身份?</view>
		<view>在你使用 EVC Wallet的时候, 一套助记词即可管理您的以太坊钱包。</view>
		<view class="subtitle">情况 1: 第一次使用 EVC Wallet, 并且之前没有备份过助记词 </view>
		<view>如果你之前没有备份过助记词, 那么你可以点击 "创建新身份", 从而创建新的数字身份。</view>
		<view class="subtitle">情况 2: 第一次使用 EVC Wallet, 但是之前有用其他钱包备份过助记词</view>
		<view>如果你之前有备份过助记词, 可以点击 "恢复已有身份", 来创建一个数字身份。</view>
		<view class="subtitle">情况 3: 当前已有数字身份, 想重新创建一个新的数字身份</view>
		<view>点击 "我" -> 点击顶部头像样式的按钮, 进入 "我的身份" 界面</view>
		<view>点击退出当前身份, 并输入密码</view>
		<view class="subtitle">请注意: 退出身份前, 请再三检查, 当初备份的该身份的助记词是否还在, 如果没有找到当初备份的助记词, 请重新备份当前身份的助记词, 再退出当前身份</view>
		<view class="title">四、如何修改钱包密码？</view>
		<view>在去中心化钱包中，所有用户的身份验证内容，如交易密码、私钥、助记词等都保存在用户手机本地，并不保存在中心化服务器中，所以用户忘记密码无法通过第三方机构（例如 EVC 团队）来重置。</view>
		<view>在 EVC Wallet  中，解决办法是通过重新导入助记词或者私钥来重新设置新的密码。</view>
		<view>重置密码教程：「我」-「管理钱包」-「选择要修改的的钱包」 -「修改密码」-「马上导入」-「助记词/私钥」</view>
		<view>PS: 一定要确保备份的助记词或者私钥是正确的。</view>
		<view class="title">五、如何恢复数字身份？</view>
		<view>1. 点击起始页面的 “恢复身份” 按键进行身份恢复。</view>
		<view>2. 点击 “恢复身份” , 勾选 “我已仔细阅读并同意以上条款” 后, 点按 “继续” 选项。将助记词输入框中。值得注意的是, 导入助记词后, 可以不受过去设置的密码约束, 重新设置新的密码。这也是为什么 “助记词” 对于我们是极端重要的原因。</view>
		<view>3. 设置密码并输入密码提示信息后。便可以点按 “恢复身份” 按键。这样已有的身份便恢复成功了。</view>
		<view class="title">六、如何创建钱包？</view>
		<view>在 EVC Wallet 内点击「我」选择「管理钱包」，点击钱包管理界面右上角“+”按钮，选择对应的公链，点击创建。</view>
		<view>创建步骤:</view>
		<view>1.输入钱包名称、钱包交易密码、密码提示信息</view>
		<view>2.根据提示保存钱包助记词</view>
		<view>3.助记词二次验证后钱包创建成功（助记词代表了资产控制权，请务必妥善保管） </view>
		<view>创建钱包后务必做好钱包备份，以免出现未备份钱包导致资产损失的情况。</view>
		<view class="title">七、如何导入钱包?</view>
		<view>EVC Wallet身份钱包可以通过创建身份 / 恢复身份两种方式导入。用户有了数字身份钱包，才能导入其它钱包。</view>
		<view>那么在当前数字身份下, 如何导入钱包呢?  </view>
		<view>1.打开 EVC Wallet 后选择右下角「我」</view>
		<view>2.点击「钱包管理」进入钱包管理界面。</view>
		<view>3.点击右上角的“+”进入添加钱包界面，</view>
		<view>4.选择钱包类型，「导入」</view>
		<view class="title">八、如何使用 EVC Wallet 转账/收款?</view>
		<view>选择你要使用的钱包，点击钱包资产中的某一代币，可以看到它的交易记录页面，在最下方有两个按键——收款与转账。</view>
		<view class="subtitle">转账</view>
		<view>点击资产界面右下角 “转账” 按键, 进入资产转账界面。这里以 ETH 为例, 输入要转账金额, 如有需要可以填写备注。在收款地址中输入对方钱包地址。点击下一步，确认交易信息并输入交易密码即可发送交易。</view>
		<view class="subtitle">收款 </view>
		<view>点击收款按键进入收款页面, 在这个页面中, 最上面的一串字符是该钱包的地址, 中间是该地址对应的二维码, 底部为 “更换资产” 与 “指定金额” 。</view>
		<view>对于没有金额限定的收款, 可以将地址字符串或者二维码直接复制给转账方, 这个地址字符串与二维码与私钥或者助记词不同, 可以放心发送给别人, 不用担心安全问题。</view>
		<view>如果遇到需要指定金额的收款时。可以点击右下角 “指定金额” 键, 在弹出的金额框中输入金额数量, 点击确定即可。</view>
	</view>
	<view class="content" v-else-if="type==2">
		<view class="title">一、防盗策略</view>
		<view>防盗的实质是防止我们的私钥泄露, 或被黑客盗取私钥。</view>
		<view class="subtitle">Keystore </view>
		<view>而在防盗策略上, Keystore 和助记词(或者是明文私钥) 的侧重点有所不同： </view>
		<view>由于 Keystore 是被加密过后的私钥, 并且其内容都是加密过后的信息, 采取抄写这种备份策略不是很科学, 所以可以存储在自己的 U 盘里, 尽量不要存储在线上或者云端, 存储 Keystore 时要和密码分开存储, 这样即使被黑客盗取 Keystore, 也很难破解。</view>
		<view class="subtitle">助记词</view>
		<view>在存储助记词时, 就需要更加谨慎一些, 因为助记词一旦被第三方窃取, 那么你的资产将面临巨大的威胁, 所以建议采用物理介质备份, 抄写在一张纸上, 并且妥善保管, 抄写时要注意准确性, 也要注意长久保存, 不要出现字迹看不清楚等问题。 </view>
		<view class="subtitle">PS: 官方建议用户使用物理介质助记词, 切勿使用截屏存储助记词, 或使用微信、QQ、邮箱或手机备忘录等方式存储助记词, Keystore 或明文私钥。</view>
		<view class="title">二、防丢策略</view>
		<view>丢失钱包大概分为四种情况: </view>
		<view class="subtitle">1. 用户在删除钱包时, 没有备份钱包 </view>
		<view>我们建议用户在创建完钱包之后, 立即备份钱包, 采用双重备份和多次备份两种策略。双重备份是指 Keystore 备份和助记词备份, 多次备份是指在备份完 Keystore 和助记词之后, 要验证备份是否正确, 反复验证, 确认无误即可。</view>
		<view class="subtitle">2. 用户忘记了 Keystore 密码</view>
		<view>我们建议用户使用强度较高的密码加密 Keystore, 这个密码最好是用户随机生成, 不常用的密码。这样提高了 Keystore 的安全性, 但是也对用户保管密码带来了巨大的挑战, 我们建议用户使用 1password 或者 lastpass 等密码管理工具, 妥善保管好自己的密码, 以防遗忘。</view>
		<view class="subtitle">3. 遗失了私钥</view>
		<view>这里的私钥包括助记词、Keystore和明文私钥, 有些用户在备份助记词时, 抄写过后并没有做验证, 或者自己过于潦草, 导致后期很难辨识, 这些都会导致无法再找到自己的钱包。所以我们在备份钱包时要仔细认真, 在后期保管钱包时, 要善于使用一些安全的管理工具, 确保自己可以随时找到私钥。</view>
		<view class="subtitle">4. 备份错钱包</view>
		<view>备份错钱包是指. 用户在 EVC Wallet 有两个钱包, 例如一个是 A 钱包, 一个是 B 钱包, 当用户想备份 A 钱包时, 却错误的备份了 B 钱包的私钥。所以我们建议用户在备份钱包之后, 一定要将备份的私钥导入钱包, 验证备份是否正确。</view>
		<view class="title">三、为什么一定要备份助记词！</view>
		<view>用户在选择钱包备份方式的时候, 可以选择备份助记词、Keystore 或者明文私钥的其中一种, 但是 EVC Wallet 还是强烈推荐用户备份助记词, 这里有几点原因:</view>
		<view>1. Keystore 虽然是加密过后的私钥, 但是不方便抄写, 一般情况下都需要通过网络传输进行存储, 而且 Keystore 往往会给用户带来安全的错觉, 曾经出现过很多使用微信收藏 Keystore 或者邮件传输 Keystore 导致代币被盗的事件。</view>
		<view>2. 明文私钥的安全等级和助记词是一样的, 都是未经加密的私钥, 但是明文私钥非常不便于用户进行抄写记忆, 私钥一旦出现抄写错误, 那么就会发生丢币的现象, 所以我们不建议备份或者传输明文私钥。</view>
		<view>3. 助记词可以管理钱包, 备份一个助记词, 就可以管理资产。因为在不同链上, 私钥是不一样的, Keystore 也不一样, 但是助记词却可以保持一致。</view>
		<view>4. 助记词便于用户抄写备份。我们推荐用户在备份的时候使用物理介质备份, 即抄写助记词备份, 这样的备份方式可以说是安全系数最高的, 完全隔绝网络, 可以有效防止黑客的专业攻击。</view>
	</view>
	<view class="content" v-else-if="type==3">
		<view class="title">助记词</view>
		<view class="title">一、为什么一定要备份助记词！</view>
		<view>用户在选择钱包备份方式的时候, 可以选择备份助记词、Keystore 或者明文私钥的其中一种, 但是 EVC Wallet 还是强烈推荐用户备份助记词, 这里有几点原因:</view>
		<view>1. Keystore 虽然是加密过后的私钥, 但是不方便抄写, 一般情况下都需要通过网络传输进行存储, 而且 Keystore 往往会给用户带来安全的错觉, 曾经出现过很多使用微信收藏 Keystore 或者邮件传输 Keystore 导致代币被盗的事件。</view>
		<view>2. 明文私钥的安全等级和助记词是一样的, 都是未经加密的私钥, 但是明文私钥非常不便于用户进行抄写记忆, 私钥一旦出现抄写错误, 那么就会发生丢币的现象, 所以我们不建议备份或者传输明文私钥。</view>
		<view>3. 助记词可以管理多链的钱包, 备份一个助记词, 就可以管理多个链的资产。因为在不同链上, 私钥是不一样的, Keystore 也不一样, 但是助记词却可以保持一致。</view>
		<view>4. 助记词便于用户抄写备份。我们推荐用户在备份的时候使用物理介质备份, 即抄写助记词备份, 这样的备份方式可以说是安全系数最高的, 完全隔绝网络, 可以有效防止黑客的专业攻击。</view>
		<view class="title">二、如何妥善备份助记词？</view>
		<view>助记词是未经任何加密措施保护的私钥, 一旦有人得到了你的助记词, 那就等同于掌控了你的钱包, 在使用助记词时候需要注意以下几点:</view>
		<view>1.在 EVC Wallet 创建钱包之后, 一定要及时备份助记词</view>
		<view>2. 备份助记词时, 要尽量采用物理介质备份, 比如手抄在一张纸上, 然后收藏好这张纸。尽可能不要使用截屏</view>
		<view>3. 要确保备份的助记词准确, 多次校对助记词是否正确, 并且可以使用其他支持助记词的钱包, 导入你所备份的助记词, 检验备份的助记词是否正确（导入的时候务必选择与 EVC Wallet 相同的导入路径） </view>
		<view>4. 一定要妥善保管好你所备份的助记词, 一是做好网络隔绝措施, 二是要好防丢措施</view>
		<view class="title">三、为什么助记词丢失没有任何办法找回？</view>
		<view>在区块链中，用户的所有资产都保存在区块链上，通过私钥来证明对链上资产的控制权，如果没有私钥，就无法控制你的资产。所以钱包的本质是一个私钥管理工具，用户使用钱包可以创建私钥，保管私钥，使用私钥签名交易。（助记词是私钥的另外一种表现形式。我们推荐用户保管助记词是因为助记词更加方便保管和使用）</view>
		<view>用户使用 EVC Wallet 创建钱包的本质是随机生成了一组助记词，由于去中心化的特性，EVC Wallet 不保管用户钱包隐私信息。所以生成助记词后，用户一定要自己保管。这组助记词可以推导出钱包的私钥，通过私钥可以推导出钱包的公钥，通过公钥可以推导出钱包地址。</view>
		<view>根据以上说明，如果要找回助记词，我们就要知道助记词的生成过程：先生成一个 128 位随机数，再加上对随机数做的校验 4 位，得到 132 位的一个数，然后按每 11 位做切分，这样就有了 12 个二进制数，然后用每个数去查 BIP39 定义的单词表，这样就得到 12 个助记词。那么问题来了，有没有可能通过暴力破解的方式碰撞出助记词呢。</view>
		<view>我们来计算一下能够生成的助记词数量，BIP39 的助记词词库共包含 2048 个单词，每组助记词共 12 个单词。根据公式：n!/( n - r )! 计算可得出数量为 2048!/(2048-12)! = 5.2715379713014884760003093175282 e+39。</view>
		<view>大家可能对这个数字没有概念，我们可以举个例子类比一下，地球上的沙子数量大约是 1 后面 18 个零。如果你可以每秒生成 一百万个助记词，那么一年可以生成 1000000*60*60*24*365=3.1536 e+13 个助记词，大约需要 1.6715937e+26 年遍历所有助记词，所以暴力破解是不可能成功的。</view>
		<view>所以对于用户来说，如果助记词、私钥全部丢失无法通过暴力破解的方式找回，因为 EVC Wallet 的去中心化特性，也无法从我们这里找回。但是如果助记词丢失，私钥还保存着，是不影响钱包使用的。</view>
		<view class="title">四、导入助记词后提示「无效的助记词」或者「助记词不正确」是什么原因？</view>
		<view>导入助记词后提示「无效的助记词」或者「助记词不正确」说明你填写的助记词是错误的，有以下几种可能：</view>
		<view class="subtitle">1. 保存的助记词中包含错误的单词，或者输入助记词的时候输入错误 </view>
		<view class="subtitle">2. 助记词格式出现了问题，如单词间多输入一个空格或者未输入空格</view>
		<view>可以从以下三个方面排查问题所在： </view>
		<view class="subtitle">1. EVC Wallet 的助记词由 12 个英文单词组成</view>
		<view class="subtitle">2. 请确保单词与单词用空格隔开，不要用回车隔开 </view>
		<view class="title">五、导入助记词后, 发现生成的钱包地址和之前的地址不一样, 是怎么回事?</view>
		<view>如果你导入助记词, 发现生成的钱包地址是一个新的钱包地址 (和之前预期的钱包地址不一致), 那么可能由三种情况, 需要逐一排查。 </view>
		<view class="subtitle">情况一：备份的助记词不是这个钱包地址的</view>
		<view>因为 EVC Wallet 可以管理多个钱包地址。假设你有 A、B 两个钱包地址, 在备份中错把A钱包的助记词对应到了B钱包的地址, 就会造成希望导入B钱包时, 导入的却是A钱包的助记词, 所以结果生成的地址是A钱包的地址, 而不是希望导入的B钱包的地址。</view>
		<view class="subtitle">Tip: 你可以在备份助记词的同时也备份其对应的钱包地址, 以此避免此类问题的出现。</view>
		<view class="subtitle">情况二：助记词抄写错误</view>
		<view>另一种可能就是助记词抄写错误, 如果抄写错误, 也会有极小的可能生成新的钱包地址。</view> 
		<view class="subtitle">情况三：路径设置问题</view>
		<view>除此之外, 也有可能是你设置了路径, 关于路径的认知问题, 可以点击这里学习查看。一般在导入钱包时, 使用默认路径即可, 自行设置路径理论上可行, 但会提高备份钱包的难度。</view>
		<view class="title">六、私钥泄露, 钱包被盗, 能请求冻结账户吗？</view>
		<view class="subtitle">如果你发生了这样的情况, 首先我们深表同情, 在向我们寻求帮助之前, 有几点情况需要和你如实说明:</view>
		<view>1.EVC Wallet 是去中心化钱包. 我们不保管你的私钥, 所以我们无法实现冻结账户或交易回滚这样的操作。</view>
		<view>2.EVC Wallet 是去中心化钱包, 我们没有存储用户的实名信息, 所以我们可能无法提供对案件有利的证据。</view>
		<view>3. 在向我们寻求帮助时, 一定要如实说明情况, 切勿有隐瞒推卸等情况, 否则不利于案件的进展。</view>
		<view class="title">七、如何安全使用 Keystore？</view>
		<view>Keystore 是使用用户自定密码加密过后的私钥, 其安全系数取决加密的密码强度是否足够强, 在使用 Keystore 的时候需要注意以下几点:</view>
		<view>1. 在EVC Wallet 创建钱包 (生成 Keystore ) 时, 要使用尽可能复杂、随机的密码, 密码强度越高, 黑客破解的难度越大, 而使用随机的密码, 避免在泄露了某一个平台的账户密码之后, 导致黑客可以轻易猜出该 Keystore 的密码。</view>
		<view>2. 要牢牢记住你加密 Keystore 的密码, 一旦忘记密码, 则无法再使用该 Keystore。</view>
		<view>3. 要将 Keystore 和密码分开存储, 一旦黑客盗取了 Keystore, 在不知道密码的前提下, 也无法快速破解该钱包。</view>
		<view>4. 不要使用邮箱或者其他线上即时通讯软件传输 Keystore 或者密码, 这样很可能会被黑客监听拦截。</view>
	</view>
	<view class="content" v-else>
		<view class="title">一、转账未打包怎么办?</view>
		<view>发送的交易长时间未打包，是由于矿工费设置较低导致的。 </view>
		<view>有两种解决办法：</view>
		<view>1. 耐心等待交易被矿工打包；</view>
		<view>2.实时矿工费查询网站：https://ethgasstation.info/</view>
		<view class="title">二、如何快速查询转账交易状态？</view>
		<view>在区块链世界中, 有一个 "快递查询工具" 的应用, 它就是 Etherscan, 网址https://etherscan.io/ </view> 
		<view>中文网址是 https://etherscan.io/language.aspx，但由于该网页的汉化水平有限, 许多翻译并不准确, 故推荐使用英文版页面。</view>
		<view>EVC Wallet钱包支持直接前往 Etherscan 查询当前交易状态，点击红框直接前往 Etherscan 查询或者复制URL到浏览器进行打开查看交易显示状态。</view>
		<view>会出现以下几种交易状态：</view>
		<view>Type 1: 我们这里以转账 KyberNetwork 为例，Success (转账成功) 。</view>
		<view>Type 2: Out of Gas (矿工费不足) 关于矿工费的感念可以看我之前的文章, 这里就不在做详细的概念讲解,  Etherscan 上查询交易如果有以下显示, 就代表 "矿工费不足" 。</view>
		<view>Type 3: Bad Instruction (错误指令) 这种问题属于一般错误类型, 但像这种交易, 虽然是失败的, 但是依然会被扣除矿工费。并且交易金额会被原路退回, 交易取消。</view>
		<view>Type 4：出现Reverted错误，属于合同执行过程中遇到错误，但像这种交易，虽然是失败的，但是依然会被扣除矿工费，并且交易金额会被原路退回，交易取消。</view>
		<view class="title">三、转账失败是什么原因？</view>
		<view>请不用担心，转账失败是不会扣除币的。</view>
		<view>转账失败主要是以下三种常见类型: </view>
		<view>Type 1: Out of Gas (矿工费不足) 关于矿工费的感念可以看我之前的文章, 这里就不在做详细的概念讲解,  Etherscan 上查询交易如果有以下显示, 就代表 "矿工费不足" 。</view>
		<view>Type 2: Bad Instruction (错误指令) 这种问题属于一般错误类型, 但像这种交易, 虽然是失败的, 但是依然会被扣除矿工费。</view>
		<view>Type 3：出现Reverted错误，属于合同执行过程中遇到错误，但像这种交易，虽然是失败的，但是依然会被扣除矿工费。</view>
		<view class="title">四、转账时填错地址怎么办？</view>
		<view>先确认转账填写的收币地址是交易所地址、个人地址还是智能合约地址。因为所有的转账交易都是发生在区块链上的，交易一旦完成，没有任何办法修改区块链数据进行交易回滚或者取消交易，只能由收币方将代币转回。</view>
		<view>如果填写的是交易所的地址，那么你转账的所有代币已经转入了交易所的钱包地址，请联系交易所客服，让他们将你误转的代币转回你的钱包。</view>
		<view>如果填写的是个人地址，可以联系对方转回代币。如果不能获得收币地址持有人的个人信息，那么没有任何办法能转回代币。</view>
		<view>如果填写的是智能合约地址，请联系合约开发者转回你的代币。</view>
		<view>建议以后在发起转账交易前务必仔细确认收币地址的正确性，避免资产损失。</view>
		<view class="title">五、交易所提币到 EVC Wallet 长时间未到账怎么办？</view>
		<view>首先要确认交易所是否转出了代币，操作方法就是前往 https://etherscan.io 查询收币地址是否有转入代币的记录，如果链上没有转入记录，说明交易所并未进行提币操作，请联系交易所客服处理。（有时候会遇到交易所显示提币成功，但是链上并没有记录的情况。一切以链上数据为准，链上没有记录就是交易所并未转出，也要联系交易所客服协助处理） </view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				type: 1
			}
		},
		onLoad(opt){
			this.type = opt.type;
		},
		methods: {
		}
	}
</script>

<style>
	page{background-color: #FFFFFF;padding-bottom: 30upx;}
	.content>view{padding: 0 20upx;line-height: 1.6;-webkit-user-select: text;}
	.title{font-weight: bold;font-size: 32upx;margin: 14upx 0;}
	.subtitle{font-weight: bold;margin: 10upx 0;}
</style>
